Repository: dfrant/LinuxApplicationDevelopment2022
Catalog: 12_Documenting/I18n.po
Languages: ru

source: Usage: ./I18n [OPTIONS]
ru: Использование: ./I18n [ПАРАМЕТРЫ]

source: This program tries to guess an integer from 1 to 100 that you guessed
ru: Эта программа пытается угадать загаданное вами целое число в диапазоне от 1 до 100

source: Arguments:
ru: Параметры:

source: -r display of numbers in the Roman system
ru: -r отображать числа в римской системе исчисления

source: --help help message output
ru: --help вывести вспомогательное сообщение

source: Functions:
ru: Функции:

source: the main function that implements the game process
ru: главная функция, реализующая процесс игры

source: converting arabic integers from 1 to 100 into roman
ru: переводит арабские целые числа от 1 до 100 в римскую систему исчисления

source: converting roman integerss from 1 to 100 into arabic
ru: переводит римские числа от 1 до 100 в арабскую систему исчисления

source: Is your digit greater, less or equal than %s?
ru: Ваше число больше, меньше или равно %s?

source: Is your digit greater, less or equal than %d?
ru: Ваше число больше, меньше или равно %d?

source: Please, choose an integer from 1 to 100
ru: Пожалуйста, загадайте целое число от 1 до 100

source: Please, choose an integer from I to C
ru: Пожалуйста, загадайте целое число от I до C

source: Unknown argument, please, read help:
ru: Неизвестный аргумент. Пожалуйста, ознакомтесь с документацией:

source: Unknown arguments, please, read help:
ru: Неизвестные аргументы. Пожалуйста, ознакомтесь с документацией:

source: greater
ru: больше

source: less
ru: меньше

source: equal
ru: равно

source: Thanks for playing!
ru: Спасибо за игру!

source: Please, type greater/less/equal
ru: Пожалуйста, введите больше/меньше/равно

source: Are you sure? Let's try playing again
ru: Вы уверены? Давайте попробуем сыграть ещё раз
